config.org
#+title: Emacs Configuration
#+author: Ben Domine
#+property: header-args:emacs-lisp :tangle yes :results silent
#+startup: overview

* Early Initialization
** Config File Shortcut
Because of how frequently I visit this file, I want a function to quickly find it. I want this to be the very first thing I do, so that if something breaks this function still ends up loading whenever possible.
#+begin_src emacs-lisp
  (defun config ()
      "Find the config file."
      (interactive)
      (find-file "~/.emacs.d/config.org"))
#+end_src

** Other Config Files
Store customize code in a different file:
#+begin_src emacs-lisp
  (setq custom-file "~/.emacs.d/custom.el")
  (load custom-file 'noerror)
#+end_src

Packages I’m currently developing will be in different files; load them also:
#+begin_src emacs-lisp
  (load "~/.emacs.d/my-project-manager.el")
  (load "~/.emacs.d/my-delete.el")
#+end_src
** Basic GUI Tweaks
First GUI customizations. We want fullscreen, no tool bar, and a dark frame:
#+begin_src emacs-lisp
  (tool-bar-mode -1)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
  (set-frame-parameter nil 'ns-appearance 'dark)
#+end_src

** Package Management
We’ll be using use-package. Much of this code comes from [[https://www.shaneikennedy.xyz/blog/emacs-intro][this blog post]] by Shane Kennedy.
First, a macro for appending to a list:
#+begin_src emacs-lisp
  (defmacro append-to-list (target suffix)
      "Append SUFFIX to TARGET in place."
      `(setq ,target (append ,target ,suffix)))
#+end_src

Next, we’ll update our package archives:
#+begin_src emacs-lisp
  (require 'package)

  (append-to-list package-archives
      '(("melpa" . "http://melpa.org/packages/")
           ("melpa-stable" . "http://stable.melpa.org/packages/")
           ("org-elpa" . "https://orgmode.org/elpa/")))
#+end_src

And load from our package list:
#+begin_src emacs-lisp
  (package-initialize)
#+end_src

Now we’ll set up use-package. We need to refresh the package archive so we can get the latest packages, and install use-package.
#+begin_src emacs-lisp
  (unless (package-installed-p 'use-package)
      (package-refresh-contents)
      (package-install 'use-package))
#+end_src

Finally, some settings for use-pacakge. We want to make ensure the default, which causes use-package to download stuff if it’s not installed. We also want to turn on verbose installation, so that we get error logging when something breaks.
#+begin_src emacs-lisp
  (setq
      use-package-always-ensure t
      use-package-verbose t)
#+end_src
* Keybindings
** Mac Rebinding
I primarily use Mac, so I want most keybindings to use the command key. So, I’ll switch the command and control keys.
#+begin_src emacs-lisp
  (setq mac-command-modifier 'control)
  (setq mac-control-modifier 'super)
#+end_src

This means that I need to resolve the keyboard conflicts that arise from mac taking over certain commands, such as command + space.
#+begin_src emacs-lisp :tangle no
  (global-set-key (kbd "C-o") 'set-mark-command)
#+end_src
** Undo, Redo
I want to use C-/ for commenting, so I’ll bind undo to C-z like normal. I don’t need to use suspend-frame much at all, so this should be acceptable.
#+begin_src emacs-lisp :tangle no
  (global-set-key (kbd "C-z") 'undo)
  (global-set-key (kbd "C-S-z") 'undo-redo)
#+end_src
** S-Expressions
The built-in keybindings for forward- and backward-sexp are prefixed with C-M-. I just generally dislike this combination.

#+begin_src emacs-lisp
  (global-set-key (kbd "M-F") 'forward-sexp)
  (global-set-key (kbd "M-B") 'backward-sexp)
#+end_src

* UI
** Scrolling
I want precision pixel scrolling, meaning that when I use the scroll wheel I want smooth scrolling instead of line-by-line scrolling. This obviously only has an impact in GUI mode. Also, it can cause lag depending on the machine and version/port of emacs!
#+begin_src emacs-lisp
  (pixel-scroll-precision-mode)
#+end_src

** Icons
I’m using nerd-icons for doom-modeline and other icon-requiring packages.
#+begin_src emacs-lisp
  (use-package nerd-icons
      :custom
      (nerd-icons-font-family "Symbols Nerd Font Mono")
      )
#+end_src

Note: if this doesn’t work on a new computer, run nerd-icons-install-fonts.

** Themes
I’ll use doom-themes because of its broad selection. Screenshots of some of these themes can be found [[https://github.com/doomemacs/themes/tree/screenshots][here]].

This is a short list of themes I like:
:themes:
- Doom-one (boring but classic)
- doom-city-lights
- Doom-oceanic-next
- doom-dark+
- Doom-solarized-dark (maybe)
- Doom-outrun-electric (probably not, it looks cool as hell though)
- Doom-snazzy (pretty basic but nice contrast)
- Doom-dracula (I really like this one actually)
:END:
For now I’ll just go with dark+.
#+begin_src emacs-lisp :results silent
  (use-package doom-themes
      :init
      (load-theme 'doom-dracula))
#+end_src

I want the active line number in line number mode to be highlighted more brightly:
#+begin_src emacs-lisp
  (set-face-attribute 'line-number-current-line nil
      :foreground (face-attribute 'highlight :background))
#+end_src

** Modeline
I’m using doom-modeline. The customization options can be found at [[https://github.com/seagle0128/doom-modeline][the github repo]].
#+begin_src emacs-lisp
  (use-package doom-modeline
      :ensure t
      :init (doom-modeline-mode 1))
#+end_src

I’ve had some issues with lag in the past, and I heard that this was supposed to help:
#+begin_src emacs-lisp
  (setq inhibit-compacting-font-caches t)
#+end_src

Let’s take advantage of the icons we’ve added and force doom-modeline to use them. This should be on by default but it can’t hurt.
#+begin_src emacs-lisp
  (setq doom-modeline-icon t)
#+end_src

I also want to see the time, but not the system load average:
#+begin_src emacs-lisp
  (setq display-time-default-load-average nil)
  (setq doom-modeline-time-icon t)
  (setq doom-modeline-time t)
  (display-time)
#+end_src

Just for fun, I’ll also enable the battery indicator, updating every 30 seconds:
#+begin_src emacs-lisp
  (setq battery-update-interval 30)
  (setq doom-modeline-battery t)
  (display-battery-mode +1)
#+end_src

** Tab Bar
I want to move away from centaur-tabs, as it’s a very buggy and generally annoying package. Instead, I’ll customize the built-in tab bar to work a little better.
#+begin_src emacs-lisp
  ;; (let ((color (face-attribute 'highlight :background)))
  ;; 	(set-face-attribute 'tab-bar-tab nil :box '(:line-width 10 :style flat-button) :underline `(:color ,color :style line :position t)
  ;; 	))
  (defun my-setup-tab-bar-faces ()
    "Apply GUI-specific faces for the tab bar."
    ;; Optional: Ensure we are in a GUI before setting GUI attributes
    (when (display-graphic-p)
      (let ((color (face-attribute 'highlight :background nil t)))
        ;; Only apply if a valid color was actually returned
        (when (and color (not (eq color 'unspecified)))
          (set-face-attribute 'tab-bar-tab nil 
                              :box '(:line-width 10 :style flat-button) 
                              :underline `(:color ,color :style line :position t))))))

  ;; If starting as a daemon, wait for the frame. 
  ;; If starting normally (standalone app), run it immediately.
  (if (daemonp)
      (add-hook 'server-after-make-frame-hook #'my-setup-tab-bar-faces)
    (my-setup-tab-bar-faces))
#+end_src

The above face adds an underline, but the box face messes with the underline on the close button for some reason. SETUP TAB BAR: replace the file path below with the file path found in ~tab-bar-close-button~ without any customization.

#+begin_src emacs-lisp
  (add-hook 'tab-bar-mode-hook (lambda () (setq tab-bar-close-button
  	#(" " 0 1
  	 (close-tab t rear-nonsticky t help-echo "Click to close tab" face
  		 (:box nil) display
  		 (image :type svg :file
  			 "/opt/homebrew/Cellar/emacs-plus@30/30.2/share/emacs/30.2/etc/images/symbols/cross_16.svg"
  			 :height (1 . em) :scale 1 :margin 1 :ascent center
  			 :transform-smoothing t))))))
#+end_src

** Minibuffer
Using vertico-posframe, it’s possible to have the minibuffer in the center of the screen. I’m not sure how much I’ll like this functionality, but I’ll test it out for now.
#+begin_src emacs-lisp
  (use-package vertico-posframe
      :after vertico
      :config
      (setq vertico-posframe-handler
          'posframe-poshandler-frame-center)
      (vertico-posframe-mode 1))
#+end_src

* Core Editing
** Project Management
I originally used project.el, but I’ve decided to try projectile instead. I’ll add that now:
#+begin_src emacs-lisp
  (use-package projectile
      :ensure t
      :init
      (setq projectile-project-search-path '("~/Coding"))
      :config
      (projectile-mode +1)
      :bind (:map projectile-mode-map
                ("C-c p" . projectile-command-map)))
#+end_src
** Jumping
I use Avy to quickly jump to any visible text. The function I primarily use here is goto-char-timer, and I’ve dropped that timer all the way down to 0.15 seconds for speed.
+I previously used goto-char-timer, and I’m starting to realize that it’s not the best for me. I always end up typing the whole word, or if not, thinking about how many characters to type. This is suboptimal, so I need a consistent method. Given this, I should just use goto-char or goto-char-2. I’ll start by trying goto-char-2.+
#+begin_src emacs-lisp
  (use-package avy
      :ensure t
      :config
      (setq avy-timeout-seconds 0.15)
      :bind (("M-j" . avy-goto-char)))

#+end_src

Just for visual clarity, I also want to briefly highlight the thing we jump to. In order to do this, let’s define a function for briefly pulsing the current thing:
#+begin_src emacs-lisp
  (defun pulse-symbol-at-point ()
      "Briefly pulse the symbol under the current point."
      (interactive)
      (let* ((bounds (bounds-of-thing-at-point 'symbol))
                (first (car bounds))
                (last (cdr bounds)))
          (pulse-momentary-highlight-region first last)))
#+end_src

+Next, run this function whenever we jump from Avy:+ The new goto-char-2 function breaks this, so I’ll have to fix it later if I decide to stay with goto-char-2.
#+begin_src emacs-lisp
  (require 'avy)

  (advice-add 'avy-goto-char-timer :after #'pulse-symbol-at-point)
#+end_src

I also want this functionality on each jump of an incremental search.
#+begin_src emacs-lisp
  (add-hook 'isearch-mode-end-hook #'pulse-symbol-at-point)
#+end_src

I also want the ability to jump between windows, for which purpose I believe ace-window is the best choice.
#+begin_src emacs-lisp
  (use-package ace-window)
  (bind-key* "M-o" 'ace-window)
#+end_src

** Commenting
I want commenting to work like in most editors. Specifically, I want to run comment-or-uncomment region; I want to run it on the region if it’s active, or the current line if not.
#+begin_src emacs-lisp
  (defun my/comment-uncomment ()
  	"Runs comment-uncomment on the region if active, or the current line if not."
  	(interactive)
      (if (region-active-p)
  		(progn (comment-or-uncomment-region (region-beginning) (region-end)))
  		(progn (push-mark)
  			(beginning-of-line)
  			(push-mark)
  			(end-of-line)
  			(comment-or-uncomment-region (region-beginning) (region-end))
  			(set-mark-command t)
  			(set-mark-command t))))

  ;; (global-set-key (kbd "C-/") 'my/comment-uncomment)
#+end_src

