config.el
(defun config ()
    "Find the config file."
    (interactive)
    (find-file "~/.emacs.d/config.org"))

(setq custom-file "~/.emacs.d/custom.el")
(load custom-file 'noerror)

(load "~/.emacs.d/my-project-manager.el")
(load "~/.emacs.d/my-delete.el")

(tool-bar-mode -1)
(add-to-list 'default-frame-alist '(fullscreen . maximized))
(set-frame-parameter nil 'ns-appearance 'dark)

(defmacro append-to-list (target suffix)
    "Append SUFFIX to TARGET in place."
    `(setq ,target (append ,target ,suffix)))

(require 'package)

(append-to-list package-archives
    '(("melpa" . "http://melpa.org/packages/")
         ("melpa-stable" . "http://stable.melpa.org/packages/")
         ("org-elpa" . "https://orgmode.org/elpa/")))

(package-initialize)

(unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

(setq
    use-package-always-ensure t
    use-package-verbose t)

(setq mac-command-modifier 'control)
(setq mac-control-modifier 'super)

(global-set-key (kbd "M-F") 'forward-sexp)
(global-set-key (kbd "M-B") 'backward-sexp)

(pixel-scroll-precision-mode)

(use-package nerd-icons
    :custom
    (nerd-icons-font-family "Symbols Nerd Font Mono")
    )

(use-package doom-themes
    :init
    (load-theme 'doom-dracula))

(set-face-attribute 'line-number-current-line nil
    :foreground (face-attribute 'highlight :background))

(use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1))

(setq inhibit-compacting-font-caches t)

(setq doom-modeline-icon t)

(setq display-time-default-load-average nil)
(setq doom-modeline-time-icon t)
(setq doom-modeline-time t)
(display-time)

(setq battery-update-interval 30)
(setq doom-modeline-battery t)
(display-battery-mode +1)

;; (let ((color (face-attribute 'highlight :background)))
;; 	(set-face-attribute 'tab-bar-tab nil :box '(:line-width 10 :style flat-button) :underline `(:color ,color :style line :position t)
;; 	))
(defun my-setup-tab-bar-faces ()
  "Apply GUI-specific faces for the tab bar."
  ;; Optional: Ensure we are in a GUI before setting GUI attributes
  (when (display-graphic-p)
    (let ((color (face-attribute 'highlight :background nil t)))
      ;; Only apply if a valid color was actually returned
      (when (and color (not (eq color 'unspecified)))
        (set-face-attribute 'tab-bar-tab nil 
                            :box '(:line-width 10 :style flat-button) 
                            :underline `(:color ,color :style line :position t))))))

;; If starting as a daemon, wait for the frame. 
;; If starting normally (standalone app), run it immediately.
(if (daemonp)
    (add-hook 'server-after-make-frame-hook #'my-setup-tab-bar-faces)
  (my-setup-tab-bar-faces))

(add-hook 'tab-bar-mode-hook (lambda () (setq tab-bar-close-button
	#(" " 0 1
	 (close-tab t rear-nonsticky t help-echo "Click to close tab" face
		 (:box nil) display
		 (image :type svg :file
			 "/opt/homebrew/Cellar/emacs-plus@30/30.2/share/emacs/30.2/etc/images/symbols/cross_16.svg"
			 :height (1 . em) :scale 1 :margin 1 :ascent center
			 :transform-smoothing t))))))

(use-package vertico-posframe
    :after vertico
    :config
    (setq vertico-posframe-handler
        'posframe-poshandler-frame-center)
    (vertico-posframe-mode 1))

(use-package projectile
    :ensure t
    :init
    (setq projectile-project-search-path '("~/Coding"))
    :config
    (projectile-mode +1)
    :bind (:map projectile-mode-map
              ("C-c p" . projectile-command-map)))

(use-package avy
    :ensure t
    :config
    (setq avy-timeout-seconds 0.15)
    :bind (("M-j" . avy-goto-char)))

(defun pulse-symbol-at-point ()
    "Briefly pulse the symbol under the current point."
    (interactive)
    (let* ((bounds (bounds-of-thing-at-point 'symbol))
              (first (car bounds))
              (last (cdr bounds)))
        (pulse-momentary-highlight-region first last)))

(require 'avy)

(advice-add 'avy-goto-char-timer :after #'pulse-symbol-at-point)

(add-hook 'isearch-mode-end-hook #'pulse-symbol-at-point)

(use-package ace-window)
(bind-key* "M-o" 'ace-window)

(defun my/comment-uncomment ()
	"Runs comment-uncomment on the region if active, or the current line if not."
	(interactive)
    (if (region-active-p)
		(progn (comment-or-uncomment-region (region-beginning) (region-end)))
		(progn (push-mark)
			(beginning-of-line)
			(push-mark)
			(end-of-line)
			(comment-or-uncomment-region (region-beginning) (region-end))
			(set-mark-command t)
			(set-mark-command t))))

;; (global-set-key (kbd "C-/") 'my/comment-uncomment)
