config.org
** Multiple Cursors
This one’s pretty straightforward. As a former VSCode user, I like multiple cursors for simultaneously editing different things (and it just looks really cool).
#+begin_src emacs-lisp :tangle no
  (package-install 'multiple-cursors)
  (require 'multiple-cursors)
#+end_src

Note: a list of mc commands can be found [[https://github.com/magnars/multiple-cursors.el?tab=readme-ov-file#command-overview][here]].

I’m not using anything close to the full functionality of this package; for now, I just want to bind C-d and C-S-d to mark and unmark the next instances of the current word.
#+begin_src emacs-lisp :tangle no
  (global-set-key (kbd "C-d") 'mc/mark-next-like-this-word)
  (global-set-key (kbd "C-S-d") 'mc/unmark-next-like-this)
#+end_src

When using this command, the word is selected by default. This leads to some inconvenience, so I’ll disable delete-selection-mode so that it’s possible to type stuff at the end of a word after using this command. We then re-enable it after exiting mc mode. I also make sure delete-selection-mode is enabled to begin with.
#+begin_src emacs-lisp :tangle no
  (delete-selection-mode 1)
  (add-hook 'multiple-cursors-mode-hook (lambda () (delete-selection-mode -1)))
  (add-hook 'multiple-cursors-mode-disabled-hook (lambda () (delete-selection-mode 1)))
#+end_src

By default, return is bound to disable mc mode. I dislike this.
#+begin_src emacs-lisp :tangle no
  (define-key mc/keymap (kbd "<return") nil)
#+end_src

Finally, the c++ mode keymap eats C-d. It would be better practice to bind it to something like C-c d, but I’m more used to C-d, so I’ll try to rebind that. Note: this doesn’t actually work 😥.
#+begin_src emacs-lisp :tangle no
  (with-eval-after-load 'c++-mode
      (define-key c++-mode-map (kbd "C-d") nil))
#+end_src

** Off-Screen Cursor
Emacs traditionally does not allow point to exist "offscreen", which is kinda annoying, so I’ll remedy that with the scroll-restore package.

#+begin_src emacs-lisp
  (use-package scroll-restore)
#+end_src

** Moving Lines
This is a feature from VSCode that I quite like. The idea is to move lines around with M-up and M-down, and also to duplicate lines up and down with M-S-up and M-S-down.

Let’s start with swapping lines up and down:
#+begin_src emacs-lisp
  (defun swap-line-up ()
      "Swap the current line with the one above it, retaining cursor position."
      (interactive)
      (if (/= (line-number-at-pos) 1)
          (let ((col (current-column)) (line (line-number-at-pos)))
              (transpose-lines 1)
              (goto-line (- line 1))
              (move-to-column col)
              )))
  
  (defun swap-line-down ()
      "Swap the current line with the one below it, retaining cursor position."
      (interactive)
      (if (/= (line-number-at-pos) (count-lines (point-min) (point-max)))
          (let ((col (current-column)) (line (line-number-at-pos)))
              (forward-line 1)
              (transpose-lines 1)
              (goto-line (+ line 1))
              (move-to-column col)
              )))
#+end_src

We then bind these to keys:
#+begin_src emacs-lisp
    (global-set-key (kbd "M-<up>") 'swap-line-up)
    (global-set-key (kbd "M-<down>") 'swap-line-down)
#+end_src

Duplicating up is very straightforward:
#+begin_src emacs-lisp
  (global-set-key (kbd "M-S-<up>") 'duplicate-line)  
#+end_src

Finally, duplicating down:
#+begin_src emacs-lisp
  (global-set-key (kbd "M-S-<down>") (lambda ()
                                         (interactive)
                                         (let ((col (current-column)))
                                             (duplicate-line)
                                             (forward-line 1)
                                             (move-to-column col))))
#+end_src
** Visual Line Mode
I want visual line mode enabled in text modes:
#+begin_src emacs-lisp
  (add-hook 'text-mode-hook 'visual-line-mode)
#+end_src
** Snippets
For snippets, particularly in LaTeX and HTML, I’ll use yasnippet:
#+begin_src emacs-lisp
  (use-package yasnippet
  	:hook (prog-mode . yas-minor-mode)
  	:config
  	(yas-reload-all))
  (yas-global-mode 1)
#+end_src
** File Saving
Emacs defaults to adding a newline at the end of the file on saving. I dislike this when editing, even though having one is conventional. At some point, I’ll probably add a function to add the newline, save, and then remove it; for now, though, I’ll just disable the newline.
#+begin_src emacs-lisp
  (setq require-final-newline nil)
  (setq mode-require-final-newline nil)
#+end_src
** Confirmation Functions
The default confirmation function is yes-or-no-p, which is a predicate that prompts for a yes or no input. I wish to replace this with y-or-n-p, which only requires a single keypress.
#+begin_src emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+end_src

** Confirm on Exit
I want to ask for confirmation before quitting emacs.
#+begin_src emacs-lisp
  (setq confirm-kill-emacs 'yes-or-no-p)
#+end_src

** Auto Revert
When a buffer is changed on disk, I want those changes to be immediately reflected in the buffer.
#+begin_src emacs-lisp
  (global-auto-revert-mode 1)
#+end_src

** Garbage Collection
I’m not entirely sure what this does, but I’ve heard it highly recommended:
#+begin_src emacs-lisp
  (setq gc-cons-threshold 1000000)
#+end_src

** Backup Files
I don’t want the auto-save or backup files that emacs normally creates.
#+begin_src emacs-lisp
  (setq make-backup-files nil)
  (setq auto-save-default nil)
#+end_src

** IBuffer
I want to replace the default buffer list with the ibuffer list:
#+begin_src emacs-lisp
  (require 'ibuffer)
  (global-set-key (kbd "C-x C-b") 'ibuffer-other-window)
#+end_src

** Better Beginning of Line
One issue with the beginning-of-line command, bound to C-a, is that it jumps over all whitespace, which is really annoying when coding. I will therefore replace it with a new version that jumps to the end of the whitespace, and then if used further toggles between the beginning of the line and the end of the whitespace. The code is taken from [[https://emacsredux.com/blog/2013/05/22/smarter-navigation-to-the-beginning-of-a-line/][here]].

#+begin_src emacs-lisp
  (defun smarter-move-beginning-of-line (arg)
    "Move point back to indentation of beginning of line.

  Move point to the first non-whitespace character on this line.
  If point is already there, move to the beginning of the line.
  Effectively toggle between the first non-whitespace character and
  the beginning of the line.

  If ARG is not nil or 1, move forward ARG - 1 lines first.  If
  point reaches the beginning or end of the buffer, stop there."
    (interactive "^p")
    (setq arg (or arg 1))

    ;; Move lines first
    (when (/= arg 1)
      (let ((line-move-visual nil))
        (forward-line (1- arg))))

    (let ((orig-point (point)))
      (back-to-indentation)
      (when (= orig-point (point))
        (move-beginning-of-line 1))))

  ;; remap C-a to `smarter-move-beginning-of-line'
  ;;(global-set-key [remap move-beginning-of-line]
                 ;; 'smarter-move-beginning-of-line)
#+end_src

* Completions and Search
** Keybinding Completion
I’ll use the which-key package to help with completions for keybindings.
#+begin_src emacs-lisp
  (use-package which-key
      :ensure t
      :config
      (which-key-mode +1))
#+end_src
** Minibuffer Completion
For completion in the minibuffer, I’ll use vertico:
#+begin_src emacs-lisp
  (use-package vertico
      :init
      (vertico-mode)
      :bind (:map vertico-map
      ("C-j" . vertico-next)
      ("C-k" . vertico-previous)))
#+end_src

I also want to hide all commands that aren’t available in the current mode. This snippet comes from the Shane Kennedy blog post I linked previously.
#+begin_src emacs-lisp
  (use-package emacs
      :custom
      (read-extended-command-predicate #'command-completion-default-include-p))
#+end_src

Finally, I’ll use marginalia. This package makes it so that the completion options in the minibuffer also display the docstring for that command.
#+begin_src emacs-lisp
  (use-package marginalia
      :init
      (marginalia-mode))
#+end_src
** In-Buffer Completion
As far as I can tell, there are two primary options for in-buffer completion: company and corfu. Because I’m already using other Minad packages, it seems most logical to go for corfu here. This is a pretty minimal setup. I currently have a map that’s commented out, because I’m still deciding on the best keybindings here.
#+begin_src emacs-lisp
  (use-package corfu
    :custom
    (corfu-auto t)
    (corfu-cycle t) ;; Enable cycling for `corfu-next/previous'
    :hook ((prog-mode . corfu-mode)
  	 (shell-mode . corfu-mode)
  	 (eshell-mode . corfu-mode))
    :bind
    (:map corfu-map
          ;;     ("TAB" . corfu-next)
          ;;     ("C-n" . corfu-next)
          ;;     ([tab] . corfu-next)
          ;;     ("C-p" . corfu-previous)
          ;;     ("S-TAB" . corfu-previous)
          ;;     ([backtab] . corfu-previous)
  	("M-<backspace>" . backward-kill-word)
  	("C-<backspace>" . backward-kill-word)
  	;; ("ESC" . corfu-quit)
  	))
#+end_src

I also want to delay the completion a little bit, instead of it popping up immediately. I have this code set up to add a time delay of 0.2 seconds; however, the corfu documentation states that this can create lag, so I’ve commented it out for now.
#+begin_src emacs-lisp
  (setq corfu-auto-delay 0)
  (setq corfu-auto-prefix 2)
#+end_src
** Fuzzy Matching
I use orderless to give completions fuzzy matching. This particular bit of code is copied directly from the Shane Kennedy blog post.
#+begin_src emacs-lisp
  (use-package orderless
      :custom
      (completion-styles '(orderless basic))
      (completion-category-defaults nil)
      (completion-category-overrides '((file (styles basic partial-completion)))))
#+end_src
** Searching
I’ll use Consult for better searching. When I say "use" I don’t actually mean use, because I haven’t figured it out yet. However, I’ll install it for now.
#+begin_src emacs-lisp :tangle no
(use-package consult
        :hook (completion-list-mode . consult-preview-at-point-mode)
        :custom
        (consult-preview-key nil)
        (consult-narrow-key nil)
        :config
        (consult-customize consult-theme consult-line consult-line-at-point :preview-key '(:debounce 0.2 any))
        )
#+end_src

#+begin_src emacs-lisp
  (use-package consult)
  (use-package consult-projectile
    :after (consult projectile))
#+end_src

I’ll replace some basic keybindings with their equivalent consult commands:

#+begin_src emacs-lisp
  (global-set-key (kbd "C-s") #'consult-line)
  (global-set-key (kbd "C-x b") #'consult-buffer)
  (global-set-key (kbd "C-M-l") #'consult-imenu)
  (global-set-key (kbd "M-y") #'consult-yank-pop)
#+end_src
** Sorting
In order to better sort lists of options, I’ll use prescient.
#+begin_src emacs-lisp
  (use-package prescient
    :config
    (prescient-persist-mode 1))
#+end_src

Integration with vertico:
#+begin_src emacs-lisp
  (use-package vertico-prescient
    :after vertico
    :config
    (setq vertico-prescient-enable-filtering nil)
    (vertico-prescient-mode 1))
#+end_src

Integration with corfu:
#+begin_src emacs-lisp
  (use-package corfu-prescient
    :after corfu
    :config
    (setq corfu-prescient-enable-filtering nil)
    (corfu-prescient-mode 1))
#+end_src

Note that currently, I’m still using orderless for filtering, and just using prescient for the sorting.

