config.el

(use-package scroll-restore)

(defun swap-line-up ()
    "Swap the current line with the one above it, retaining cursor position."
    (interactive)
    (if (/= (line-number-at-pos) 1)
        (let ((col (current-column)) (line (line-number-at-pos)))
            (transpose-lines 1)
            (goto-line (- line 1))
            (move-to-column col)
            )))

(defun swap-line-down ()
    "Swap the current line with the one below it, retaining cursor position."
    (interactive)
    (if (/= (line-number-at-pos) (count-lines (point-min) (point-max)))
        (let ((col (current-column)) (line (line-number-at-pos)))
            (forward-line 1)
            (transpose-lines 1)
            (goto-line (+ line 1))
            (move-to-column col)
            )))

(global-set-key (kbd "M-<up>") 'swap-line-up)
(global-set-key (kbd "M-<down>") 'swap-line-down)

(global-set-key (kbd "M-S-<up>") 'duplicate-line)

(global-set-key (kbd "M-S-<down>") (lambda ()
                                       (interactive)
                                       (let ((col (current-column)))
                                           (duplicate-line)
                                           (forward-line 1)
                                           (move-to-column col))))

(add-hook 'text-mode-hook 'visual-line-mode)

(use-package yasnippet
	:hook (prog-mode . yas-minor-mode)
	:config
	(yas-reload-all))
(yas-global-mode 1)

(setq require-final-newline nil)
(setq mode-require-final-newline nil)

(defalias 'yes-or-no-p 'y-or-n-p)

(setq confirm-kill-emacs 'yes-or-no-p)

(global-auto-revert-mode 1)

(setq gc-cons-threshold 1000000)

(setq make-backup-files nil)
(setq auto-save-default nil)

(require 'ibuffer)
(global-set-key (kbd "C-x C-b") 'ibuffer-other-window)

(defun smarter-move-beginning-of-line (arg)
  "Move point back to indentation of beginning of line.

Move point to the first non-whitespace character on this line.
If point is already there, move to the beginning of the line.
Effectively toggle between the first non-whitespace character and
the beginning of the line.

If ARG is not nil or 1, move forward ARG - 1 lines first.  If
point reaches the beginning or end of the buffer, stop there."
  (interactive "^p")
  (setq arg (or arg 1))

  ;; Move lines first
  (when (/= arg 1)
    (let ((line-move-visual nil))
      (forward-line (1- arg))))

  (let ((orig-point (point)))
    (back-to-indentation)
    (when (= orig-point (point))
      (move-beginning-of-line 1))))

;; remap C-a to `smarter-move-beginning-of-line'
;;(global-set-key [remap move-beginning-of-line]
               ;; 'smarter-move-beginning-of-line)

(use-package which-key
    :ensure t
    :config
    (which-key-mode +1))

(use-package vertico
    :init
    (vertico-mode)
    :bind (:map vertico-map
    ("C-j" . vertico-next)
    ("C-k" . vertico-previous)))

(use-package emacs
    :custom
    (read-extended-command-predicate #'command-completion-default-include-p))

(use-package marginalia
    :init
    (marginalia-mode))

(use-package corfu
  :custom
  (corfu-auto t)
  (corfu-cycle t) ;; Enable cycling for `corfu-next/previous'
  :hook ((prog-mode . corfu-mode)
	 (shell-mode . corfu-mode)
	 (eshell-mode . corfu-mode))
  :bind
  (:map corfu-map
        ;;     ("TAB" . corfu-next)
        ;;     ("C-n" . corfu-next)
        ;;     ([tab] . corfu-next)
        ;;     ("C-p" . corfu-previous)
        ;;     ("S-TAB" . corfu-previous)
        ;;     ([backtab] . corfu-previous)
	("M-<backspace>" . backward-kill-word)
	("C-<backspace>" . backward-kill-word)
	;; ("ESC" . corfu-quit)
	))

(setq corfu-auto-delay 0)
(setq corfu-auto-prefix 2)

(use-package orderless
    :custom
    (completion-styles '(orderless basic))
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles basic partial-completion)))))

(use-package consult)
(use-package consult-projectile
  :after (consult projectile))

(global-set-key (kbd "C-s") #'consult-line)
(global-set-key (kbd "C-x b") #'consult-buffer)
(global-set-key (kbd "C-M-l") #'consult-imenu)
(global-set-key (kbd "M-y") #'consult-yank-pop)

(use-package prescient
  :config
  (prescient-persist-mode 1))

(use-package vertico-prescient
  :after vertico
  :config
  (setq vertico-prescient-enable-filtering nil)
  (vertico-prescient-mode 1))

(use-package corfu-prescient
  :after corfu
  :config
  (setq corfu-prescient-enable-filtering nil)
  (corfu-prescient-mode 1))
