config.org
* Org Mode
** UI Improvements
I’m using org-modern to improve the ui on org-mode documents. I haven’t customized this much yet, but probably will do so in the future.
#+begin_src emacs-lisp
  (package-install 'org-modern)
  (with-eval-after-load 'org (global-org-modern-mode))
#+end_src

I want org-modern to ignore tables, because it conflicts with valign.

#+begin_src emacs-lisp
  (setq org-modern-table nil)
#+end_src

I also want my documents centered when on a larger screen, so I’ll use Olivetti.
#+begin_src emacs-lisp
  (package-install 'olivetti)
  (setq olivetti-body-width 0.6)
  (add-hook 'org-mode-hook #'olivetti-mode)
#+end_src

Finally, I always want org indent mode on. This indents subsequent headings and just makes it much easier to see what heading I’m under. I’ll also enable visual line mode.
#+begin_src emacs-lisp
  (add-hook 'org-mode-hook 'org-indent-mode)
  (add-hook 'org-mode-hook 'visual-line-mode)
#+end_src
** LaTeX
I use CDLatex to input LaTeX quickly.
#+begin_src emacs-lisp
  (package-install 'cdlatex)
  (require 'cdlatex)
#+end_src

I also have a few custom templates for CDLatex.
#+begin_src emacs-lisp
  (setq cdlatex-command-alist
      '(("lap" "Insert Laplace transform" "\\mathcal L {" cdlatex-lr-pair nil nil t)
           ("ilap" "Insert inverse Laplace transform" "\\mathcal L^{-1} {" cdlatex-lr-pair nil nil t)
           ("lim" "Insert limit" "\\lim_{?}" cdlatex-position-cursor nil nil t)
           ("()" "Insert inline math" "\\(?\\)" cdlatex-position-cursor nil t nil)
  	 ("tt" "Insert \\text{}" "\\text{?}" cdlatex-position-cursor nil nil t)
           ("hb" "Insert \\hbar" "\\hbar" nil nil nil t)
  	 ("bb" "Insert \\mathbb" "\\mathbb " nil nil nil t)))
#+end_src

Similarly, some templates for modifying text:
#+begin_src emacs-lisp
  (setq cdlatex-math-modify-alist
        '((118 "\\vb*" nil t nil nil)))
  ;; 6 items: key, mathcmd, textcmd, type (t if has argument, nil if style), rmdot (for if the dot on i and j should be removed idk), and t if italic correction is required.
#+end_src

Finally, though this is not directly related to org mode, I have a custom command to insert inline math, bound to C-(. It uses CDLatex to move the cursor back to the center of the parentheses.
#+begin_src emacs-lisp
  (defun begin-inline-math ()
      "Begins an inline math environment with \\(\\).  Requires cdlatex."
      (interactive)
      (insert "\\(?\\)")
      (cdlatex-position-cursor))
  (add-hook 'org-cdlatex-mode-hook (lambda ()
                                       (keymap-set org-cdlatex-mode-map "C-(" #'begin-inline-math)))  
#+end_src

Now we need to ensure that CDLatex is enabled in all org mode buffers.
#+begin_src emacs-lisp
  (add-hook 'org-mode-hook #'turn-on-org-cdlatex)
#+end_src

I’ll also use Auctex for some other LaTeX utilities like syntax highlighting.
#+begin_src emacs-lisp
  (package-install 'auctex)
  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq-default TeX-master nil)
#+end_src

** Encryption
I’ll use GPG and org-crypt to allow for the encryption of specific headings in org mode.
#+begin_src emacs-lisp
  (require 'org-crypt)
  (org-crypt-use-before-save-magic)
  (setq org-crypt-key nil)
#+end_src

I want encryption on the crypt tag:
#+begin_src emacs-lisp
  (setq org-crypt-tag-matcher "crypt")
  (setq org-tags-exclude-from-inheritance '("crypt"))
#+end_src

** Roam
Previous note-taking has been accomplished with text files, and more recently with hierarchical org note files. I’d like to instead use org-roam for notes.
#+begin_src emacs-lisp
  (use-package org-roam
  	:ensure t
  	:custom
  	(org-roam-directory "~/org-roam")
  	:bind (("C-c n l" . org-roam-buffer-toggle)
  			  ("C-c n f" . org-roam-node-find)
  			  ("C-c n i" . org-roam-node-insert)
  			  :map org-roam-dailies-map
  			  ("Y" . org-roam-dailies-capture-yesterday)
  			  ("T" . org-roam-dailies-capture-tomorrow))
  	:bind-keymap
  	("C-c n d" . org-roam-dailies-map)
  	:config
  	(require 'org-roam-dailies)
  	(org-roam-setup))
#+end_src

The org-roam author recommends displaying the org-roam buffer as a separate window like this:
#+begin_src emacs-lisp
  (add-to-list 'display-buffer-alist
  	'("\\*org-roam\\*"
  		 (display-buffer-in-direction)
  		 (direction . right)
  		 (window-width . 0.33)
  		 (window-height . fit-window-to-buffer)))
#+end_src

I’ll want to create some custom capture templates at some point, so I’ll override the templates variable, currently only providing the default template:
#+begin_src emacs-lisp
  (setq org-roam-capture-templates
        '(("d" "default" plain "%?"
    	 :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
    			    "#+title: ${title}\n")
    	 :unnarrowed t
  	 :empty-lines 1
  	 )
  	("p" "physics" plain "%?"
    	 :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
    			    "#+startup: latexpreview\n#+latex_header: \\usepackage{physics}\n#+filetags: :physics:\n#+title: ${title}")
    	 :unnarrowed t
  	 )
  	("m" "math" plain "%?"
    	 :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
    			    "#+startup: latexpreview\n#+filetags: :math:\n#+title: ${title}")
    	 :unnarrowed t
  	 )))
#+end_src

I also want to use file tags to distinguish between subjects:
#+begin_src emacs-lisp
  (setq org-roam-node-display-template
        (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
#+end_src

** Roam Dailies
All daily roam notes should be stored in the /daily subfolder:
#+begin_src emacs-lisp
  (setq org-roam-dailies-directory "daily/")
#+end_src

I want two capture templates. The first is copied directly from the documentation, and consists solely of a single headline. The second is for journal entries, and is therefore its own node. Journal id is 04086C07-D098-4447-9999-43E974375A32
#+begin_src emacs-lisp
  (setq org-roam-dailies-capture-templates
      '(("d" "default" plain
            "* %?"
            :target (file+head "%<%Y-%m-%d>.org"
                        "#+title: %<%Y-%m-%d>\n")
  		  :empty-lines 1)
  		 ("j" "journal" entry
  			 "* Journal: %^{Title}\n\n%?"
  			 :target (file+head "%<%Y-%m-%d>.org"
  						 "#+title: %<%Y-%m-%d>\n")
  			 :empty-lines 1)
  		 ))
#+end_src
** Roam UI
There’s a package for displaying a graph of all your org-roam nodes. I don’t think it’s that useful, but it looks cool so why not.
#+begin_src emacs-lisp
  (use-package org-roam-ui
      :after org-roam
  	;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  	;;         a hookable mode anymore, you're advised to pick something yourself
  	;;         if you don't care about startup time, use
  	;;  :hook (after-init . org-roam-ui-mode)
      :config
      (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))
#+end_src

In the future, I’d like to prevent it from automatically opening a tab in my browser, and instead display it with an xwidget-webkit.

** Custom Commands
One great thing about org mode is that you can have a large document but hide the majority of it, excepting only what you’re currently working on. However, there’s no good command to do this. I’m therefore adding a shortcut by combining two other commands.
#+begin_src emacs-lisp
  (defun org-fold-all-reveal ()
  	"Cycle global visibility, then reveal."
  	(interactive)
  	(org-shifttab 1)
  	(org-fold-reveal)
  	(message "")
  	)
#+end_src

I want this bound to C-c C-h in org mode.
#+begin_src emacs-lisp
  (define-key org-mode-map (kbd "C-c C-h") #'org-fold-all-reveal)
#+end_src

** Tables
I’m noticing that table alignment fails when using things like previewed latex. I’ll try to fix this with valign.
#+begin_src emacs-lisp
  (use-package valign
  	:hook (org-mode . valign-mode)
  	:config (setq valign-fancy-bar t))
#+end_src

** Babel
In order to use org mode’s excellent Babel feature, I need to include the languages I want to use here:
#+begin_src emacs-lisp
  (org-babel-do-load-languages
  	'org-babel-load-languages '((python . t)))
#+end_src

This fixes python, hopefully, but is system dependent:
#+begin_src emacs-lisp
  (setq org-babel-python-command "/usr/bin/python3")
#+end_src

* Programming
** Language Server Protocol Client
I want to use the built-in eglot for LSP stuff.
#+begin_src emacs-lisp
  (use-package eglot
    :ensure t
    :hook ((python-ts-mode . eglot-ensure)
           (c-ts-mode      . eglot-ensure)
           (c++-ts-mode    . eglot-ensure)
           (js-ts-mode     . eglot-ensure)
           (java-ts-mode   . eglot-ensure))
    :config
    (add-to-list 'eglot-server-programs
                 '(html-mode . ("vscode-html-language-server" "--stdio"))))
#+end_src

** Language Servers
For c++, I want to use clangd. I’m going to assume this is already installed via homebrew on mac:
#+begin_src emacs-lisp
  ;; (if (eq system-type 'darwin)
  ;; 	(setq lsp-clients-clangd-executable "/opt/homebrew/bin/clangd"))
#+end_src

** Web Development
For quick completions, I’ll use emmet-mode:
#+begin_src emacs-lisp
  (use-package emmet-mode
  	:hook (html-mode css-mode web-mode)
  	:config
  	(keymap-set emmet-mode-keymap "TAB" #'emmet-expand-line))
#+end_src

I also want to make mhtml mode inherit the prog-mode stuff:
#+begin_src emacs-lisp
  ;; (add-hook 'mhtml-mode-hook (lambda ()
  ;; 			     (run-hooks 'prog-mode-hook)))
  (derived-mode-add-parents 'mhtml-mode '(prog-mode))
#+end_src

