config.el

(package-install 'org-modern)
(with-eval-after-load 'org (global-org-modern-mode))

(setq org-modern-table nil)

(package-install 'olivetti)
(setq olivetti-body-width 0.6)
(add-hook 'org-mode-hook #'olivetti-mode)

(add-hook 'org-mode-hook 'org-indent-mode)
(add-hook 'org-mode-hook 'visual-line-mode)

(package-install 'cdlatex)
(require 'cdlatex)

(setq cdlatex-command-alist
    '(("lap" "Insert Laplace transform" "\\mathcal L {" cdlatex-lr-pair nil nil t)
         ("ilap" "Insert inverse Laplace transform" "\\mathcal L^{-1} {" cdlatex-lr-pair nil nil t)
         ("lim" "Insert limit" "\\lim_{?}" cdlatex-position-cursor nil nil t)
         ("()" "Insert inline math" "\\(?\\)" cdlatex-position-cursor nil t nil)
	 ("tt" "Insert \\text{}" "\\text{?}" cdlatex-position-cursor nil nil t)
         ("hb" "Insert \\hbar" "\\hbar" nil nil nil t)
	 ("bb" "Insert \\mathbb" "\\mathbb " nil nil nil t)))

(setq cdlatex-math-modify-alist
      '((118 "\\vb*" nil t nil nil)))
;; 6 items: key, mathcmd, textcmd, type (t if has argument, nil if style), rmdot (for if the dot on i and j should be removed idk), and t if italic correction is required.

(defun begin-inline-math ()
    "Begins an inline math environment with \\(\\).  Requires cdlatex."
    (interactive)
    (insert "\\(?\\)")
    (cdlatex-position-cursor))
(add-hook 'org-cdlatex-mode-hook (lambda ()
                                     (keymap-set org-cdlatex-mode-map "C-(" #'begin-inline-math)))

(add-hook 'org-mode-hook #'turn-on-org-cdlatex)

(package-install 'auctex)
(setq TeX-auto-save t)
(setq TeX-parse-self t)
(setq-default TeX-master nil)

(require 'org-crypt)
(org-crypt-use-before-save-magic)
(setq org-crypt-key nil)

(setq org-crypt-tag-matcher "crypt")
(setq org-tags-exclude-from-inheritance '("crypt"))

(use-package org-roam
	:ensure t
	:custom
	(org-roam-directory "~/org-roam")
	:bind (("C-c n l" . org-roam-buffer-toggle)
			  ("C-c n f" . org-roam-node-find)
			  ("C-c n i" . org-roam-node-insert)
			  :map org-roam-dailies-map
			  ("Y" . org-roam-dailies-capture-yesterday)
			  ("T" . org-roam-dailies-capture-tomorrow))
	:bind-keymap
	("C-c n d" . org-roam-dailies-map)
	:config
	(require 'org-roam-dailies)
	(org-roam-setup))

(add-to-list 'display-buffer-alist
	'("\\*org-roam\\*"
		 (display-buffer-in-direction)
		 (direction . right)
		 (window-width . 0.33)
		 (window-height . fit-window-to-buffer)))

(setq org-roam-capture-templates
      '(("d" "default" plain "%?"
  	 :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
  			    "#+title: ${title}\n")
  	 :unnarrowed t
	 :empty-lines 1
	 )
	("p" "physics" plain "%?"
  	 :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
  			    "#+startup: latexpreview\n#+latex_header: \\usepackage{physics}\n#+filetags: :physics:\n#+title: ${title}")
  	 :unnarrowed t
	 )
	("m" "math" plain "%?"
  	 :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
  			    "#+startup: latexpreview\n#+filetags: :math:\n#+title: ${title}")
  	 :unnarrowed t
	 )))

(setq org-roam-node-display-template
      (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))

(setq org-roam-dailies-directory "daily/")

(setq org-roam-dailies-capture-templates
    '(("d" "default" plain
          "* %?"
          :target (file+head "%<%Y-%m-%d>.org"
                      "#+title: %<%Y-%m-%d>\n")
		  :empty-lines 1)
		 ("j" "journal" entry
			 "* Journal: %^{Title}\n\n%?"
			 :target (file+head "%<%Y-%m-%d>.org"
						 "#+title: %<%Y-%m-%d>\n")
			 :empty-lines 1)
		 ))

(use-package org-roam-ui
    :after org-roam
	;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
	;;         a hookable mode anymore, you're advised to pick something yourself
	;;         if you don't care about startup time, use
	;;  :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))

(defun org-fold-all-reveal ()
	"Cycle global visibility, then reveal."
	(interactive)
	(org-shifttab 1)
	(org-fold-reveal)
	(message "")
	)

(define-key org-mode-map (kbd "C-c C-h") #'org-fold-all-reveal)

(use-package valign
	:hook (org-mode . valign-mode)
	:config (setq valign-fancy-bar t))

(org-babel-do-load-languages
	'org-babel-load-languages '((python . t)))

(setq org-babel-python-command "/usr/bin/python3")

(use-package eglot
  :ensure t
  :hook ((python-ts-mode . eglot-ensure)
         (c-ts-mode      . eglot-ensure)
         (c++-ts-mode    . eglot-ensure)
         (js-ts-mode     . eglot-ensure)
         (java-ts-mode   . eglot-ensure))
  :config
  (add-to-list 'eglot-server-programs
               '(html-mode . ("vscode-html-language-server" "--stdio"))))

;; (if (eq system-type 'darwin)
;; 	(setq lsp-clients-clangd-executable "/opt/homebrew/bin/clangd"))

(use-package emmet-mode
	:hook (html-mode css-mode web-mode)
	:config
	(keymap-set emmet-mode-keymap "TAB" #'emmet-expand-line))

;; (add-hook 'mhtml-mode-hook (lambda ()
;; 			     (run-hooks 'prog-mode-hook)))
(derived-mode-add-parents 'mhtml-mode '(prog-mode))
