config.org
** Syntax Highlighting
I’ll use tree-sitter for completion. It’s included with emacs now, but this config should allow me to set the sources for my languages.
#+begin_src emacs-lisp
  (use-package treesit
    ;; No :ensure t because it's built into Emacs 30
    :ensure nil
    :config
    (setq treesit-language-source-alist
          '((python "https://github.com/tree-sitter/tree-sitter-python")
            (javascript "https://github.com/tree-sitter/tree-sitter-javascript")
            (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
            (c "https://github.com/tree-sitter/tree-sitter-c")
            (java "https://github.com/tree-sitter/tree-sitter-java")
            (css "https://github.com/tree-sitter/tree-sitter-css")
            (html "https://github.com/tree-sitter/tree-sitter-html"))))

  (setq treesit-extra-load-path '("~/.emacs.d/tree-sitter-gdscript/src"))
#+end_src

I also want to remap most programming modes to use their treesit counterparts:
#+begin_src emacs-lisp
  ;; Remap standard modes to Tree-sitter modes
  (setq major-mode-remap-alist
        '((python-mode     . python-ts-mode)
          (c-mode          . c-ts-mode)
          (c++-mode        . c++-ts-mode)
          (js-mode         . js-ts-mode)
  	(javascript-mode . js-ts-mode)
          (java-mode       . java-ts-mode)
          (css-mode        . css-ts-mode)
          (html-mode       . html-ts-mode)
          (typescript-mode . typescript-ts-mode)))
#+end_src

** Highlight Current Line
Emacs has a built-in minor mode to highlight the current line, which I want to be active in all programming modes.

#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook #'hl-line-mode)
#+end_src

** Linting
I’ll use the built-in flymake package for linting. This should require minimal configuration. I will bind some keys to jump between errors.
#+begin_src emacs-lisp
  (use-package flymake
    :bind (("M-n" . flymake-goto-next-error)  ; Move to next error
           ("M-p" . flymake-goto-prev-error)) ; Move to previous error
    :hook (prog-mode . flymake-mode))
#+end_src

** Version Control
For help with version control, I’ll use magit. I currently don’t have this customized at all.
#+begin_src emacs-lisp
  (use-package magit)
#+end_src

I also want to use forge, which is the magit integration with git forges like github and gitlab.
#+begin_src emacs-lisp
  (use-package forge
    :after magit)
#+end_src

** Indentation
I want indentation lines to be displayed, so I’ll use the indent-bars package.
#+begin_src emacs-lisp
  (use-package indent-bars
    :ensure t
    :hook ((prog-mode . indent-bars-mode))
    :config
    (setq 
          indent-bars-prefer-character t

          ;; Show indent guides starting from the first column.
          indent-bars-starting-column 0
          ;; Make indent guides subtle; the default is too distractingly colorful.
          indent-bars-width-frac 0.15  ; make bitmaps thinner
          indent-bars-color-by-depth nil
          indent-bars-color '(font-lock-comment-face :face-bg nil :blend 0.425)
          ;; Don't highlight current level indentation; it's distracting and is
          ;; unnecessary overhead for little benefit.
          indent-bars-highlight-current-depth nil
          ;; The default is `t', which shows indent-bars even on blank lines
          ;; beyond the end of an indented block. Setting it to `nil' will cause
          ;; gaps in the indent guides, which looks odd. `least' is a good
          ;; compromise, and doesn't suffer the scrolling issue.
          indent-bars-display-on-blank-lines 'least))
#+end_src

** Line numbers
I want line numbers when programming. The last two lines here make sure the line number bar takes up a constant amount of space, preventing weird shifts when scrolling.
#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook 'display-line-numbers-mode)
  (setq display-line-numbers-width-start t)
  (setq display-line-numbers-grow-only t)

#+end_src

** Parentheses
I’ve historically just used the built-in electric-pair-mode.
#+begin_src emacs-lisp
  ;; (add-hook 'prog-mode-hook 'electric-pair-local-mode)
#+end_src

However, I’m going to try smartparens instead:
#+begin_src emacs-lisp
  (use-package smartparens
    :ensure smartparens
    :hook (prog-mode text-mode markdown-mode)
    :config
    (require 'smartparens-config))
#+end_src

This does mean that I have to reimplement electric-pair-open-newline-between-pairs, however. This is the function that will be called whenever I hit enter after making a pair:
#+begin_src emacs-lisp
  (defun my/newline-and-indent-handler (&rest _ignored)
    "Vertically split an expression inside of a pair."
    (newline-and-indent)
    (forward-line -1)
    (indent-according-to-mode))
#+end_src

And here’s the binding of that handler:
#+begin_src emacs-lisp
  (require 'smartparens)
  (sp-local-pair 'prog-mode "{" nil :post-handlers '((my/newline-and-indent-handler "RET")))
#+end_src

** Python
Emacs is better than Jupyter notebooks, so I’ve implemented a helper function for Babel that executes all the code in a given session in order. This first function gets the session name for a given code block.
#+begin_src emacs-lisp
  (defun my/org-babel-get-session ()
  "Return the name of the current Babel source block session."
  (interactive)
  (cdr (assoc :session (nth 2 (org-babel-get-src-block-info)))))
#+end_src

This second function is a modified version of org-babel-execute-buffer, which tests each source block against the session name the function is called from.
#+begin_src emacs-lisp
  (defun my/org-babel-execute-session (&optional arg)
    "Execute all source blocks in the buffer, belonging to the current session."
    (interactive)
    (let ((current-session (my/org-babel-get-session)))
      (org-babel-eval-wipe-error-buffer)
      (org-save-outline-visibility t
        (org-babel-map-executables nil
  	(if (and
  	     (my/org-babel-get-session)
  	     (string= current-session (my/org-babel-get-session))
  	     (not (string= (my/org-babel-get-session) "none")))
  	    (if (org-element-type-p
  		 (org-element-context) '(babel-call inline-babel-call))
  		(org-babel-lob-execute-maybe)
                (org-babel-execute-src-block arg))))))
    (org-display-inline-images))
#+end_src

I’m going to want this to be a pretty easy command to execute quickly.
#+begin_src emacs-lisp
  (keymap-set org-babel-map "C-v" 'my/org-babel-execute-session)
#+end_src

** Godot
I’ll add Godot’s emacs package.
#+begin_src emacs-lisp
  (use-package gdscript-mode)
#+end_src

** Authentication
I want to use only one file for keeping secrets and other authentication tokens, authinfo.gpg.
#+begin_src emacs-lisp
  (setq auth-sources "~/.authinfo.gpg")
#+end_src

** Code Folding
I just like to have the ability to fold blocks of code at will. This is accomplished using the hideshow minor mode:
#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook 'hs-minor-mode)
#+end_src

* Projects
** Web Server
I often want to start a server to preview a web project. I’ll use a custom function to do this, using projectile. I’ve bound this to C-c C-p w, which is the projectile prefix + w.
#+begin_src emacs-lisp
  (require 'projectile)
  (defun start-web-server-in-project ()
      "Start a simple Python web server in root directory of current project."
      (interactive)
      (projectile-run-async-shell-command-in-root "python3 -m http.server"))

  (define-key projectile-mode-map (kbd "C-c p w") #'start-web-server-in-project)
#+end_src
** Treemacs
Treemacs is a package which creates a buffer displaying the file structure of the current project.
#+begin_src emacs-lisp
  (use-package treemacs
      :ensure t
      :defer t
      :bind
  	(:map global-map
  		("C-c t" . treemacs)))
#+end_src

I want to use this with projectile, which requires the treemacs-projectile package:
#+begin_src emacs-lisp
  (use-package treemacs-projectile
  	:after (treemacs projectile)
  	:ensure t)
#+end_src

* Writing
** Minor Mode
I want to have a minor mode for writing text in emacs. This minor mode should override much of my customization; I want to use a variable-pitch font, enable Olivetti, and change the color theme to have black text on a white background.
#+begin_src emacs-lisp
  (define-minor-mode writing-mode
  	"Minor mode for writing text in a distraction-free environment."
  	:lighter "Writing"
  	:init-value nil
  	(if writing-mode
  		(progn
  			(if (member "Domine" (font-family-list))
  				(setq-local writing--family "Domine")
  				(setq-local writing--family "Times New Roman"))
  			(setq-local face-remapping-alist
  				`((default
  					  :background "#ffffff"
  					  :foreground "#000000"
  					  :family ,writing--family
  					  :height 140)))
  			;; (setq-local face-remapping-alist
  			;; 	(append face-remapping-alist
  			;; 		 '((mode-line (:height 1))
  			;; 		 (mode-line-inactive (:height 1)))))
  			(olivetti-mode 1)
  			(line-number-mode -1)
  			(setq-local writing--mode-line-format mode-line-format)
  			(setq-local mode-line-format nil)
  			(when (bound-and-true-p centaur-tabs-mode)
  				(centaur-tabs-local-mode)
  				(message "toggled")))
  		(buffer-face-mode -1)
  		(kill-local-variable 'face-remapping-alist)
  		(olivetti-mode -1)
  		(setq-local mode-line-format writing--mode-line-format)))
#+end_src

* Miscellaneous
** Exec Path from Shell
This one has come highly recommended; env variables should be grabbed from the shell.
#+begin_src emacs-lisp
  (use-package exec-path-from-shell
      :config
      (exec-path-from-shell-initialize))
#+end_src
