config.el

(use-package treesit
  ;; No :ensure t because it's built into Emacs 30
  :ensure nil
  :config
  (setq treesit-language-source-alist
        '((python "https://github.com/tree-sitter/tree-sitter-python")
          (javascript "https://github.com/tree-sitter/tree-sitter-javascript")
          (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
          (c "https://github.com/tree-sitter/tree-sitter-c")
          (java "https://github.com/tree-sitter/tree-sitter-java")
          (css "https://github.com/tree-sitter/tree-sitter-css")
          (html "https://github.com/tree-sitter/tree-sitter-html"))))

(setq treesit-extra-load-path '("~/.emacs.d/tree-sitter-gdscript/src"))

;; Remap standard modes to Tree-sitter modes
(setq major-mode-remap-alist
      '((python-mode     . python-ts-mode)
        (c-mode          . c-ts-mode)
        (c++-mode        . c++-ts-mode)
        (js-mode         . js-ts-mode)
	(javascript-mode . js-ts-mode)
        (java-mode       . java-ts-mode)
        (css-mode        . css-ts-mode)
        (html-mode       . html-ts-mode)
        (typescript-mode . typescript-ts-mode)))

(add-hook 'prog-mode-hook #'hl-line-mode)

(use-package flymake
  :bind (("M-n" . flymake-goto-next-error)  ; Move to next error
         ("M-p" . flymake-goto-prev-error)) ; Move to previous error
  :hook (prog-mode . flymake-mode))

(use-package magit)

(use-package forge
  :after magit)

(use-package indent-bars
  :ensure t
  :hook ((prog-mode . indent-bars-mode))
  :config
  (setq 
        indent-bars-prefer-character t

        ;; Show indent guides starting from the first column.
        indent-bars-starting-column 0
        ;; Make indent guides subtle; the default is too distractingly colorful.
        indent-bars-width-frac 0.15  ; make bitmaps thinner
        indent-bars-color-by-depth nil
        indent-bars-color '(font-lock-comment-face :face-bg nil :blend 0.425)
        ;; Don't highlight current level indentation; it's distracting and is
        ;; unnecessary overhead for little benefit.
        indent-bars-highlight-current-depth nil
        ;; The default is `t', which shows indent-bars even on blank lines
        ;; beyond the end of an indented block. Setting it to `nil' will cause
        ;; gaps in the indent guides, which looks odd. `least' is a good
        ;; compromise, and doesn't suffer the scrolling issue.
        indent-bars-display-on-blank-lines 'least))

(add-hook 'prog-mode-hook 'display-line-numbers-mode)
(setq display-line-numbers-width-start t)
(setq display-line-numbers-grow-only t)

;; (add-hook 'prog-mode-hook 'electric-pair-local-mode)

(use-package smartparens
  :ensure smartparens
  :hook (prog-mode text-mode markdown-mode)
  :config
  (require 'smartparens-config))

(defun my/newline-and-indent-handler (&rest _ignored)
  "Vertically split an expression inside of a pair."
  (newline-and-indent)
  (forward-line -1)
  (indent-according-to-mode))

(require 'smartparens)
(sp-local-pair 'prog-mode "{" nil :post-handlers '((my/newline-and-indent-handler "RET")))

(defun my/org-babel-get-session ()
"Return the name of the current Babel source block session."
(interactive)
(cdr (assoc :session (nth 2 (org-babel-get-src-block-info)))))

(defun my/org-babel-execute-session (&optional arg)
  "Execute all source blocks in the buffer, belonging to the current session."
  (interactive)
  (let ((current-session (my/org-babel-get-session)))
    (org-babel-eval-wipe-error-buffer)
    (org-save-outline-visibility t
      (org-babel-map-executables nil
	(if (and
	     (my/org-babel-get-session)
	     (string= current-session (my/org-babel-get-session))
	     (not (string= (my/org-babel-get-session) "none")))
	    (if (org-element-type-p
		 (org-element-context) '(babel-call inline-babel-call))
		(org-babel-lob-execute-maybe)
              (org-babel-execute-src-block arg))))))
  (org-display-inline-images))

(keymap-set org-babel-map "C-v" 'my/org-babel-execute-session)

(use-package gdscript-mode)

(setq auth-sources "~/.authinfo.gpg")

(add-hook 'prog-mode-hook 'hs-minor-mode)

(require 'projectile)
(defun start-web-server-in-project ()
    "Start a simple Python web server in root directory of current project."
    (interactive)
    (projectile-run-async-shell-command-in-root "python3 -m http.server"))

(define-key projectile-mode-map (kbd "C-c p w") #'start-web-server-in-project)

(use-package treemacs
    :ensure t
    :defer t
    :bind
	(:map global-map
		("C-c t" . treemacs)))

(use-package treemacs-projectile
	:after (treemacs projectile)
	:ensure t)

(define-minor-mode writing-mode
	"Minor mode for writing text in a distraction-free environment."
	:lighter "Writing"
	:init-value nil
	(if writing-mode
		(progn
			(if (member "Domine" (font-family-list))
				(setq-local writing--family "Domine")
				(setq-local writing--family "Times New Roman"))
			(setq-local face-remapping-alist
				`((default
					  :background "#ffffff"
					  :foreground "#000000"
					  :family ,writing--family
					  :height 140)))
			;; (setq-local face-remapping-alist
			;; 	(append face-remapping-alist
			;; 		 '((mode-line (:height 1))
			;; 		 (mode-line-inactive (:height 1)))))
			(olivetti-mode 1)
			(line-number-mode -1)
			(setq-local writing--mode-line-format mode-line-format)
			(setq-local mode-line-format nil)
			(when (bound-and-true-p centaur-tabs-mode)
				(centaur-tabs-local-mode)
				(message "toggled")))
		(buffer-face-mode -1)
		(kill-local-variable 'face-remapping-alist)
		(olivetti-mode -1)
		(setq-local mode-line-format writing--mode-line-format)))

(use-package exec-path-from-shell
    :config
    (exec-path-from-shell-initialize))
