config.org
** Splash Screen
This is my custom splash screen. I’ll begin by defining a function for convenience. This inserts some text, centers it in the buffer, and then adds a newline.
#+begin_src emacs-lisp
  (defun center-and-newline (text)
        "Insert the provided TEXT, center and newline."
        (insert text)
        (center-line)
        (insert "\n"))
#+end_src

Next, I’ll have a function for turning a given buffer into the splash screen:
#+begin_src emacs-lisp
  (defun bendomine/create-splash-screen()
  	(read-only-mode -1)
  	(erase-buffer)

  	(set-fill-column (window-body-width nil))

  	(let* (
                (height (- (window-body-height nil) 1))
                (offset 10)
                (vertical-padding (- (/ height 2) offset)))
  		(insert-char ?\n vertical-padding))

  	(center-and-newline "+---------------------------------------------------------+")
  	(center-and-newline "| 8888888888888b     d888       d8888 .d8888b.  .d8888b.  |")
  	(center-and-newline "| 888       8888b   d8888      d88888d88P  Y88bd88P  Y88b |")
  	(center-and-newline "| 888       88888b.d88888     d88P888888    888Y88b.      |")
  	(center-and-newline "| 8888888   888Y88888P888    d88P 888888        \"Y888b.   |")
  	(center-and-newline "| 888       888 Y888P 888   d88P  888888           \"Y88b. |")
  	(center-and-newline "| 888       888  Y8P  888  d88P   888888    888      \"888 |")
  	(center-and-newline "| 888       888   \"   888 d8888888888Y88b  d88PY88b  d88P |")
  	(center-and-newline "| 8888888888888       888d88P     888 \"Y8888P\"  \"Y8888P\"  |")
  	(center-and-newline "+---------------------------------------------------------+")

  	(insert "\n")

  	(center-and-newline "Customized by Ben Domine")
  	(insert "\n\n")

  	(insert-text-button "Open config file" 'action (lambda (_) (config)) 'follow-link t)
  	(center-line) (insert "\n\n")
  	;; (local-set-key (kbd "c") (lambda (_) (config)))

  	(insert-text-button "Create org document" 'action (lambda (_)
                                                            (let ((buffer (generate-new-buffer "New org document")))
                                                                (switch-to-buffer buffer)
                                                                (org-mode))) 'follow-link t)
  	(center-line) (insert "\n\n")
  	(insert-text-button "New journal entry" 'action (lambda (_) (org-roam-dailies-capture-today nil "j")) 'follow-link t)
  	;; (local-set-key (kbd "j") (lambda (_) (org-roam-dailies-capture-today nil "j")))
  	
  	(center-line) (insert "\n")

  	(setq mode-line-format nil)
  	(setq cursor-type nil)
  	(setq horizontal-scroll-bar nil)
  	(setq vertical-scroll-bar nil)

  	(read-only-mode 1)
  	(buffer-disable-undo))
#+end_src

Now I have a function to create a buffer and run the previous command:
#+begin_src emacs-lisp
  (defun bendomine/splash-screen ()
      "Display my custom splash screen."
      (interactive)

      (let ((new-buffer (get-buffer-create "*Splash Screen*")))
          (with-current-buffer new-buffer
              (bendomine/create-splash-screen))

          (switch-to-buffer new-buffer)
          (when (bound-and-true-p centaur-tabs-mode) (if (or centaur-tabs-mode centaur-tabs-local-mode) (centaur-tabs-local-mode)))
          (message "")))
#+end_src

Finally, I’ll display that splash screen after load, with a tiny delay to ensure that the frame resizes first:
#+begin_src emacs-lisp
  (add-hook 'window-setup-hook (lambda ()
                                   (run-at-time "0.3 sec" nil #'bendomine/splash-screen)))
#+end_src

I also want to add some local keybindings to quickly choose menu items.
#+begin_src emacs-lisp

#+end_src

** Preventing Messages on C-scroll
This is kind of stupid, but I sometimes have the C modifier key held down when scrolling, and I don’t want that to be special behavior:
#+begin_src emacs-lisp
  (global-set-key (kbd "C-<wheel-up>") nil)
  (global-set-key (kbd "C-<wheel-down>") nil)
#+end_src

** Emacs Everywhere
I’m really not sure what I think about this, but I’ll try emacs-everywhere and see if I end up using it.
#+begin_src emacs-lisp
  (use-package emacs-everywhere
    :ensure t)
#+end_src

I also need to set a specific server directory:
#+begin_src emacs-lisp :tangle no
  (setq server-socket-dir "~/.emacs.d/server")
#+end_src

** Better Documentation
I’ll use the helpful package to improve help windows.
#+begin_src emacs-lisp
  (use-package helpful
    :ensure t)
#+end_src

* EVIL
** General Setup
I’m gonna try evil.

#+begin_src emacs-lisp
  ;; Enable Evil
  (use-package evil
    :init
    (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
    (setq evil-want-keybinding nil) ;; Required for evil-collection to work properly
    (setq evil-want-C-u-scroll t)   ;; Allow C-u to scroll up like in Vim
    (setq evil-want-C-i-jump t)     ;; Allow C-i to jump forward like in Vim
    :config
    (evil-mode 1))
#+end_src

** Collection
And I guess I have to use evil-collection for it to work with my other packages:

#+begin_src emacs-lisp
  (use-package evil-collection
    :after evil
    :ensure t
    :config
    (evil-collection-init))
#+end_src

** Comments
I’m going to use the evil package for commenting, to see if I prefer it to my normal style.
#+begin_src emacs-lisp
  (use-package evil-commentary
    :config
    (evil-commentary-mode))
#+end_src

** Escape Sequence
Escape to escape makes sense, but I’d like to rebind it to something a little closer to home (literally).
#+begin_src emacs-lisp
  (use-package evil-escape
    :ensure t
    :init
    (setq-default evil-escape-key-sequence "jk")
    (setq-default evil-escape-delay 0.15)
    :config
    (evil-escape-mode 1))
#+end_src

** Visual Line vs Logical Line
I want to move by visual line and not by logical line.
#+begin_src emacs-lisp
  (define-key evil-normal-state-map (kbd "j") 'evil-next-visual-line)
  (define-key evil-normal-state-map (kbd "k") 'evil-previous-visual-line)
  (define-key evil-normal-state-map (kbd "gj") 'evil-next-line)
  (define-key evil-normal-state-map (kbd "gk") 'evil-previous-line)
#+end_src

** Leader Key
I want to use the spacebar as a leader, doom-style. I therefore have a big list of commands here:
#+begin_src emacs-lisp
  (require 'ibuffer)
  (require 'helpful)
  (require 'magit)
  (require 'projectile)
  (use-package general
    :ensure t
    :config
    ;; Tell general to integrate with Evil
    (general-evil-setup t)

    ;; Create a custom definer for your leader keys
    (general-create-definer my-leader-def
  			  :states '(normal visual insert emacs)
  			  :keymaps 'override
  			  :prefix "SPC"
  			  ;; This allows you to use Alt+Space as the leader in insert mode
  			  :non-normal-prefix "M-SPC") 

    ;; Now define your keybindings using your new definer
    (my-leader-def
     "SPC" 'execute-extended-command ;; SPC SPC for M-x
     "."   'find-file
     ","   'switch-to-buffer
     "s"   'save-buffer

     ;; File commands
     "f"   '(:ignore t :which-key "file")
     "ff"  'find-file
     "fs"  'save-buffer

     ;; Buffer commands
     "b"   '(:ignore t :which-key "buffer")
     "bb"  'switch-to-buffer
     "bi"  'ibuffer-other-window
     "bk"  'kill-buffer
     "bd"  'kill-current-buffer

     ;; Help commands
     "h"   '(:ignore t :which-key "describe")
     "hf"  'helpful-callable
     "hv"  'helpful-variable
     "hm"  'describe-mode
     "hk"  'helpful-key

     ;; Window commands
     "w"   '(:ignore t :which-key "window")
     "wc"  'delete-window
     "ww"  'delete-other-windows
     "wr"  'split-window-right
     "wd"  'split-window-below
     "wh"  'evil-window-left
     "wj"  'evil-window-down
     "wk"  'evil-window-up
     "wl"  'evil-window-right

     ;; Quit commands
     "q"   '(:ignore t :which-key "quit")
     "qr"  'restart-emacs
     "qq"  'save-buffers-kill-terminal

     ;; Magit commands
     "g"   '(:ignore t :which-key "magit")
     "gg"  'magit-status

     ;; Projectile commands
     "p"   '(:ignore t :which-key "projectile")
     "pp"  'projectile-switch-project
     "pf"  'projectile-find-file
     "pa"  'projectile-add-known-project

     ;; Tab commands
     "t"   '(:ignore t :which-key "tabs")
     "tt"  'tab-new
     "tc"  'tab-close
     "tr"  'tab-rename
     "tl"  'tab-next
     "th"  'tab-previous
     "t SPC" 'tab-switch))

#+end_src
