config.el

(defun center-and-newline (text)
      "Insert the provided TEXT, center and newline."
      (insert text)
      (center-line)
      (insert "\n"))

(defun bendomine/create-splash-screen()
	(read-only-mode -1)
	(erase-buffer)

	(set-fill-column (window-body-width nil))

	(let* (
              (height (- (window-body-height nil) 1))
              (offset 10)
              (vertical-padding (- (/ height 2) offset)))
		(insert-char ?\n vertical-padding))

	(center-and-newline "+---------------------------------------------------------+")
	(center-and-newline "| 8888888888888b     d888       d8888 .d8888b.  .d8888b.  |")
	(center-and-newline "| 888       8888b   d8888      d88888d88P  Y88bd88P  Y88b |")
	(center-and-newline "| 888       88888b.d88888     d88P888888    888Y88b.      |")
	(center-and-newline "| 8888888   888Y88888P888    d88P 888888        \"Y888b.   |")
	(center-and-newline "| 888       888 Y888P 888   d88P  888888           \"Y88b. |")
	(center-and-newline "| 888       888  Y8P  888  d88P   888888    888      \"888 |")
	(center-and-newline "| 888       888   \"   888 d8888888888Y88b  d88PY88b  d88P |")
	(center-and-newline "| 8888888888888       888d88P     888 \"Y8888P\"  \"Y8888P\"  |")
	(center-and-newline "+---------------------------------------------------------+")

	(insert "\n")

	(center-and-newline "Customized by Ben Domine")
	(insert "\n\n")

	(insert-text-button "Open config file" 'action (lambda (_) (config)) 'follow-link t)
	(center-line) (insert "\n\n")
	;; (local-set-key (kbd "c") (lambda (_) (config)))

	(insert-text-button "Create org document" 'action (lambda (_)
                                                          (let ((buffer (generate-new-buffer "New org document")))
                                                              (switch-to-buffer buffer)
                                                              (org-mode))) 'follow-link t)
	(center-line) (insert "\n\n")
	(insert-text-button "New journal entry" 'action (lambda (_) (org-roam-dailies-capture-today nil "j")) 'follow-link t)
	;; (local-set-key (kbd "j") (lambda (_) (org-roam-dailies-capture-today nil "j")))
	
	(center-line) (insert "\n")

	(setq mode-line-format nil)
	(setq cursor-type nil)
	(setq horizontal-scroll-bar nil)
	(setq vertical-scroll-bar nil)

	(read-only-mode 1)
	(buffer-disable-undo))

(defun bendomine/splash-screen ()
    "Display my custom splash screen."
    (interactive)

    (let ((new-buffer (get-buffer-create "*Splash Screen*")))
        (with-current-buffer new-buffer
            (bendomine/create-splash-screen))

        (switch-to-buffer new-buffer)
        (when (bound-and-true-p centaur-tabs-mode) (if (or centaur-tabs-mode centaur-tabs-local-mode) (centaur-tabs-local-mode)))
        (message "")))

(add-hook 'window-setup-hook (lambda ()
                                 (run-at-time "0.3 sec" nil #'bendomine/splash-screen)))



(global-set-key (kbd "C-<wheel-up>") nil)
(global-set-key (kbd "C-<wheel-down>") nil)

(use-package emacs-everywhere
  :ensure t)

(use-package helpful
  :ensure t)

;; Enable Evil
(use-package evil
  :init
  (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
  (setq evil-want-keybinding nil) ;; Required for evil-collection to work properly
  (setq evil-want-C-u-scroll t)   ;; Allow C-u to scroll up like in Vim
  (setq evil-want-C-i-jump t)     ;; Allow C-i to jump forward like in Vim
  :config
  (evil-mode 1))

(use-package evil-collection
  :after evil
  :ensure t
  :config
  (evil-collection-init))

(use-package evil-commentary
  :config
  (evil-commentary-mode))

(use-package evil-escape
  :ensure t
  :init
  (setq-default evil-escape-key-sequence "jk")
  (setq-default evil-escape-delay 0.15)
  :config
  (evil-escape-mode 1))

(define-key evil-normal-state-map (kbd "j") 'evil-next-visual-line)
(define-key evil-normal-state-map (kbd "k") 'evil-previous-visual-line)
(define-key evil-normal-state-map (kbd "gj") 'evil-next-line)
(define-key evil-normal-state-map (kbd "gk") 'evil-previous-line)

(require 'ibuffer)
(require 'helpful)
(require 'magit)
(require 'projectile)
(use-package general
  :ensure t
  :config
  ;; Tell general to integrate with Evil
  (general-evil-setup t)

  ;; Create a custom definer for your leader keys
  (general-create-definer my-leader-def
			  :states '(normal visual insert emacs)
			  :keymaps 'override
			  :prefix "SPC"
			  ;; This allows you to use Alt+Space as the leader in insert mode
			  :non-normal-prefix "M-SPC") 

  ;; Now define your keybindings using your new definer
  (my-leader-def
   "SPC" 'execute-extended-command ;; SPC SPC for M-x
   "."   'find-file
   ","   'switch-to-buffer
   "s"   'save-buffer

   ;; File commands
   "f"   '(:ignore t :which-key "file")
   "ff"  'find-file
   "fs"  'save-buffer

   ;; Buffer commands
   "b"   '(:ignore t :which-key "buffer")
   "bb"  'switch-to-buffer
   "bi"  'ibuffer-other-window
   "bk"  'kill-buffer
   "bd"  'kill-current-buffer

   ;; Help commands
   "h"   '(:ignore t :which-key "describe")
   "hf"  'helpful-callable
   "hv"  'helpful-variable
   "hm"  'describe-mode
   "hk"  'helpful-key

   ;; Window commands
   "w"   '(:ignore t :which-key "window")
   "wc"  'delete-window
   "ww"  'delete-other-windows
   "wr"  'split-window-right
   "wd"  'split-window-below
   "wh"  'evil-window-left
   "wj"  'evil-window-down
   "wk"  'evil-window-up
   "wl"  'evil-window-right

   ;; Quit commands
   "q"   '(:ignore t :which-key "quit")
   "qr"  'restart-emacs
   "qq"  'save-buffers-kill-terminal

   ;; Magit commands
   "g"   '(:ignore t :which-key "magit")
   "gg"  'magit-status

   ;; Projectile commands
   "p"   '(:ignore t :which-key "projectile")
   "pp"  'projectile-switch-project
   "pf"  'projectile-find-file
   "pa"  'projectile-add-known-project))
